<!DOCTYPE html>
<html>
<head>
    <title>PHP Info</title>
</head>
    <body>
        <h1>PHP Info</h1>
        <h1>お手製のphp</h1>
        <h1>俺は開発環境からの更新手順も完全に理解した。</h1>
        <h1>ECRリポジトリの更新、タスク定義の更新、コンテナの再デプロイ。これらの実行のタイミングがわからんぞ、、、、</h1>
        <h1>結構色々なことがわかり始めてきた</h1>
        <p>とりあえず2024/01/07はgithub上でデプロイできるところまでやってみよう。</p>
        <p>OIDCを用いたワークフローのうち、イメージをPushするところは完成。これで動作するか確認。</p>
        <h1>2021/01/07イメージをプッシュしたのに、内容が更新されない、、、、なぜだろう？？？</h1>
        <h1>mainに特有の変更</h1>
        <h1>mainに特有の変更二つ目</h1>
    </body>
</html>

<?php
phpinfo();

